## This is the SQL Practice assignment, done on the local database

In [1]:
%load_ext sql

In [2]:
##%sql mysql+pymysql://root:passwd@localhost/country_club

'Connected: root@country_club'

In [3]:
%sql USE country_club

 * mysql+pymysql://root:***@localhost/country_club
0 rows affected.

[]

** Q1: Some of the facilities charge a fee to members, but some do not.
 Please list the names of the facilities that do.**

In [11]:
%%sql
SELECT name
FROM Facilities
WHERE membercost >0

 * mysql+pymysql://root:***@localhost/country_club
5 rows affected.

[('Tennis Court 1',),
 ('Tennis Court 2',),
 ('Massage Room 1',),
 ('Massage Room 2',),
 ('Squash Court',)]

**Q2: How many facilities do not charge a fee to members?**

In [13]:
%%sql
SELECT 
  COUNT( * ) AS Num
FROM Facilities
WHERE membercost =0

 * mysql+pymysql://root:***@localhost/country_club
1 rows affected.

[(4,)]

**Q3: How can you produce a list of facilities that charge a fee to members,
where the fee is less than 20% of the facility's monthly maintenance cost?
Return the facid, facility name, member cost, and monthly maintenance of the
facilities in question.**

In [14]:
%%sql
SELECT 
  facid,
  name, 
  membercost,
  monthlymaintenance
FROM Facilities
WHERE membercost < monthlymaintenance * 0.2

 * mysql+pymysql://root:***@localhost/country_club
9 rows affected.

[(0, 'Tennis Court 1', Decimal('5.0'), 200),
 (1, 'Tennis Court 2', Decimal('5.0'), 200),
 (2, 'Badminton Court', Decimal('0.0'), 50),
 (3, 'Table Tennis', Decimal('0.0'), 10),
 (4, 'Massage Room 1', Decimal('9.9'), 3000),
 (5, 'Massage Room 2', Decimal('9.9'), 3000),
 (6, 'Squash Court', Decimal('3.5'), 80),
 (7, 'Snooker Table', Decimal('0.0'), 15),
 (8, 'Pool Table', Decimal('0.0'), 15)]

**Q4: How can you retrieve the details of facilities with ID 1 and 5?
Write the query without using the OR operator.**

In [15]:
%%sql
SELECT *
FROM Facilities
WHERE facid IN (1, 5)

 * mysql+pymysql://root:***@localhost/country_club
2 rows affected.

[(1, 'Tennis Court 2', Decimal('5.0'), Decimal('25.0'), 8000, 200),
 (5, 'Massage Room 2', Decimal('9.9'), Decimal('80.0'), 4000, 3000)]

**Q5: How can you produce a list of facilities, with each labelled as
'cheap' or 'expensive', depending on if their monthly maintenance cost is
more than $100? Return the name and monthly maintenance of the facilities
in question.**

In [16]:
%%sql
SELECT
  name,
  monthlymaintenance,
  (CASE WHEN monthlymaintenance >100 THEN 'expensive' ELSE 'cheap' END) AS label
FROM Facilities

 * mysql+pymysql://root:***@localhost/country_club
9 rows affected.

[('Tennis Court 1', 200, 'expensive'),
 ('Tennis Court 2', 200, 'expensive'),
 ('Badminton Court', 50, 'cheap'),
 ('Table Tennis', 10, 'cheap'),
 ('Massage Room 1', 3000, 'expensive'),
 ('Massage Room 2', 3000, 'expensive'),
 ('Squash Court', 80, 'cheap'),
 ('Snooker Table', 15, 'cheap'),
 ('Pool Table', 15, 'cheap')]

**Q6: You'd like to get the first and last name of the last member(s)
who signed up. Do not use the LIMIT clause for your solution.**

In [17]:
%%sql
SELECT 
  firstname,
  surname
FROM Members
WHERE joindate IN (SELECT MAX( joindate ) FROM Members)

 * mysql+pymysql://root:***@localhost/country_club
1 rows affected.

[('Darren', 'Smith')]

**Q7: How can you produce a list of all members who have used a tennis court?
Include in your output the name of the court, and the name of the member
formatted as a single column. Ensure no duplicate data, and order by
the member name.**

In [22]:
%%sql
SELECT DISTINCT sub.*
FROM (
SELECT 
  CONCAT(m.firstname, ' ', m.surname) AS member_name,
  f.name
FROM Members m
INNER JOIN Bookings b
ON m.memid = b.memid
INNER JOIN Facilities f
ON f.facid = b.facid
WHERE LOWER(f.name) LIKE 'tennis court%'
) AS sub
ORDER BY sub.member_name

 * mysql+pymysql://root:***@localhost/country_club
46 rows affected.

[('Anne Baker', 'Tennis Court 1'),
 ('Anne Baker', 'Tennis Court 2'),
 ('Burton Tracy', 'Tennis Court 2'),
 ('Burton Tracy', 'Tennis Court 1'),
 ('Charles Owen', 'Tennis Court 1'),
 ('Charles Owen', 'Tennis Court 2'),
 ('Darren Smith', 'Tennis Court 2'),
 ('David Farrell', 'Tennis Court 2'),
 ('David Farrell', 'Tennis Court 1'),
 ('David Jones', 'Tennis Court 2'),
 ('David Jones', 'Tennis Court 1'),
 ('David Pinker', 'Tennis Court 1'),
 ('Douglas Jones', 'Tennis Court 1'),
 ('Erica Crumpet', 'Tennis Court 1'),
 ('Florence Bader', 'Tennis Court 2'),
 ('Florence Bader', 'Tennis Court 1'),
 ('Gerald Butters', 'Tennis Court 2'),
 ('Gerald Butters', 'Tennis Court 1'),
 ('GUEST GUEST', 'Tennis Court 2'),
 ('GUEST GUEST', 'Tennis Court 1'),
 ('Henrietta Rumney', 'Tennis Court 2'),
 ('Jack Smith', 'Tennis Court 2'),
 ('Jack Smith', 'Tennis Court 1'),
 ('Janice Joplette', 'Tennis Court 1'),
 ('Janice Joplette', 'Tennis Court 2'),
 ('Jemima Farrell', 'Tennis Court 1'),
 ('Jemima Farrell', 'Tennis Court 2'),
 ('Joan Coplin', 'Tennis Court 1'),
 ('John Hunt', 'Tennis Court 1'),
 ('John Hunt', 'Tennis Court 2'),
 ('Matthew Genting', 'Tennis Court 1'),
 ('Millicent Purview', 'Tennis Court 2'),
 ('Nancy Dare', 'Tennis Court 2'),
 ('Nancy Dare', 'Tennis Court 1'),
 ('Ponder Stibbons', 'Tennis Court 2'),
 ('Ponder Stibbons', 'Tennis Court 1'),
 ('Ramnaresh Sarwin', 'Tennis Court 1'),
 ('Ramnaresh Sarwin', 'Tennis Court 2'),
 ('Tim Boothe', 'Tennis Court 2'),
 ('Tim Boothe', 'Tennis Court 1'),
 ('Tim Rownam', 'Tennis Court 2'),
 ('Tim Rownam', 'Tennis Court 1'),
 ('Timothy Baker', 'Tennis Court 2'),
 ('Timothy Baker', 'Tennis Court 1'),
 ('Tracy Smith', 'Tennis Court 2'),
 ('Tracy Smith', 'Tennis Court 1')]

**Q8: How can you produce a list of bookings on the day of 2012-09-14 which
will cost the member (or guest) more than $30? Remember that guests have
different costs to members (the listed costs are per half-hour 'slot'), and
the guest user's ID is always 0. Include in your output the name of the
facility, the name of the member formatted as a single column, and the cost.
Order by descending cost, and do not use any subqueries.**

In [19]:
%%sql
SELECT 
  b.bookid AS booking_id,
  CONCAT( m.firstname, " ", m.surname ) AS name,
  CASE WHEN m.memid =0 THEN f.guestcost * b.slots ELSE f.membercost * b.slots END AS cost,
  f.name AS facility_name,
  b.starttime AS TIME
FROM Bookings b
INNER JOIN Members m 
ON b.memid = m.memid
INNER JOIN Facilities f 
ON f.facid = b.facid
WHERE CAST( b.starttime AS DATE ) = CAST( '2012-09-14' AS DATE ) AND (CASE WHEN m.memid = 0 THEN f.guestcost*b.slots>30 ELSE f.membercost * b.slots >30 END)
ORDER BY cost DESC

 * mysql+pymysql://root:***@localhost/country_club
12 rows affected.

[(2946, 'GUEST GUEST', Decimal('320.0'), 'Massage Room 2', '2012-09-14 11:00:00'),
 (2937, 'GUEST GUEST', Decimal('160.0'), 'Massage Room 1', '2012-09-14 09:00:00'),
 (2940, 'GUEST GUEST', Decimal('160.0'), 'Massage Room 1', '2012-09-14 13:00:00'),
 (2942, 'GUEST GUEST', Decimal('160.0'), 'Massage Room 1', '2012-09-14 16:00:00'),
 (2926, 'GUEST GUEST', Decimal('150.0'), 'Tennis Court 2', '2012-09-14 17:00:00'),
 (2920, 'GUEST GUEST', Decimal('75.0'), 'Tennis Court 1', '2012-09-14 16:00:00'),
 (2922, 'GUEST GUEST', Decimal('75.0'), 'Tennis Court 1', '2012-09-14 19:00:00'),
 (2925, 'GUEST GUEST', Decimal('75.0'), 'Tennis Court 2', '2012-09-14 14:00:00'),
 (2948, 'GUEST GUEST', Decimal('70.0'), 'Squash Court', '2012-09-14 09:30:00'),
 (2941, 'Jemima Farrell', Decimal('39.6'), 'Massage Room 1', '2012-09-14 14:00:00'),
 (2949, 'GUEST GUEST', Decimal('35.0'), 'Squash Court', '2012-09-14 12:30:00'),
 (2951, 'GUEST GUEST', Decimal('35.0'), 'Squash Court', '2012-09-14 15:00:00')]

**Q9: This time, produce the same result as in Q8, but using a subquery.**

In [20]:
%%sql
SELECT sub.*
FROM (
SELECT 
  b.bookid AS booking_id,
  CONCAT( m.firstname, " ", m.surname ) AS name,
  CASE WHEN m.memid =0 THEN f.guestcost * b.slots ELSE f.membercost * b.slots END AS cost,
  f.name AS facility_name,
  b.starttime AS TIME
FROM Bookings b
INNER JOIN Members m 
ON b.memid = m.memid
INNER JOIN Facilities f 
ON f.facid = b.facid
WHERE CAST( b.starttime AS DATE ) = CAST( '2012-09-14' AS DATE ) 
) sub
WHERE sub.cost > 30
ORDER BY sub.cost DESC

 * mysql+pymysql://root:***@localhost/country_club
12 rows affected.

[(2946, 'GUEST GUEST', Decimal('320.0'), 'Massage Room 2', '2012-09-14 11:00:00'),
 (2937, 'GUEST GUEST', Decimal('160.0'), 'Massage Room 1', '2012-09-14 09:00:00'),
 (2940, 'GUEST GUEST', Decimal('160.0'), 'Massage Room 1', '2012-09-14 13:00:00'),
 (2942, 'GUEST GUEST', Decimal('160.0'), 'Massage Room 1', '2012-09-14 16:00:00'),
 (2926, 'GUEST GUEST', Decimal('150.0'), 'Tennis Court 2', '2012-09-14 17:00:00'),
 (2920, 'GUEST GUEST', Decimal('75.0'), 'Tennis Court 1', '2012-09-14 16:00:00'),
 (2922, 'GUEST GUEST', Decimal('75.0'), 'Tennis Court 1', '2012-09-14 19:00:00'),
 (2925, 'GUEST GUEST', Decimal('75.0'), 'Tennis Court 2', '2012-09-14 14:00:00'),
 (2948, 'GUEST GUEST', Decimal('70.0'), 'Squash Court', '2012-09-14 09:30:00'),
 (2941, 'Jemima Farrell', Decimal('39.6'), 'Massage Room 1', '2012-09-14 14:00:00'),
 (2949, 'GUEST GUEST', Decimal('35.0'), 'Squash Court', '2012-09-14 12:30:00'),
 (2951, 'GUEST GUEST', Decimal('35.0'), 'Squash Court', '2012-09-14 15:00:00')]

**Q10: Produce a list of facilities with a total revenue less than 1000.
The output of facility name and total revenue, sorted by revenue. Remember
that there's a different cost for guests and members!**

In [21]:
%%sql
SELECT 
  f.name
FROM Bookings b
INNER JOIN Facilities f
ON f.facid = b.facid
GROUP BY 1
HAVING SUM(CASE WHEN b.memid = 0 THEN f.guestcost*b.slots ELSE f.membercost*b.slots END) < 1000
ORDER BY SUM(CASE WHEN b.memid = 0 THEN f.guestcost*b.slots ELSE f.membercost*b.slots END)

 * mysql+pymysql://root:***@localhost/country_club
3 rows affected.

[('Table Tennis',), ('Snooker Table',), ('Pool Table',)]